## Pandas Part1

In [ ]:
import pandas as pd
import numpy as np

#### 시리즈
 - 생성 (p142)

In [ ]:
# 시리즈 생성
# 판다스의 1차원 자료 구조, 넘파이 1차원 배열 기반
# pd.Series 함수
object1 = pd.Series( [4, 5, -3, 6])
object1

0    4
1    5
2   -3
3    6
dtype: int64

In [ ]:
type(object1)

pandas.core.series.Series

In [ ]:
print(object1)

0    4
1    5
2   -3
3    6
dtype: int64

In [ ]:
# 출력 시 print 대신 display 사용
display(object1)

0    4
1    5
2   -3
3    6
dtype: int64

In [ ]:
# 생성 시 인덱스 지정
# index 매개변수
# 데이터 개수와 같은 개수의 인덱스를 지정
object2 = pd.Series([4,5,-3,6] ,index=['a','b','c','d'])
object2

a    4
b    5
c   -3
d    6
dtype: int64

#### 시리즈 주요 속성 (p143)

In [ ]:
# 주요 속성
# index 조회
object2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
# 전체 값 조회
object2.values

array([ 4,  5, -3,  6])

In [ ]:
# ndim, shape
# 넘파이의 차원, 크기 조회 속성
object2.ndim, object2.shape

(1, (4,))

In [ ]:
# dtype
# 시리즈의 데이터 타입 확인
# 시리즈 내 값은 동일 데이터 타입
object2.dtype

dtype('int64')

#### 시리즈 인덱스 변경

In [ ]:
# index 속성 
# 열과 동일 개수로 전달
object2.index = ['aa', 'bb', 'cc', 'dd']
object2

aa    4
bb    5
cc   -3
dd    6
dtype: int64

In [ ]:
# rename 함수
# rename 함수는 series, df 모두 사용 가능
# 사전의 형태로 {old:new} 전달
# inplace는 원본 수정 여부, 기본은 False(수정된 시리즈는 반환 값으로), True면 원본 수정(반환X)
# axis는 series이기 때문에 변경 안 함
a = object2.rename({'aa':'a'})
a

a     4
bb    5
cc   -3
dd    6
dtype: int64

In [ ]:
object2.rename({'bb':'b'}, inplace=True)

In [ ]:
object2

aa    4
b     5
cc   -3
dd    6
dtype: int64

#### 시리즈의 인덱싱 및 슬라이싱 (p144)

In [ ]:
# 시리즈의 인덱싱
# 정수 혹은 문자열(label)을 이용한 인덱싱 가능
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# 레이블 인덱스를 지정하지 않으면 기본은 정수 인덱스가 노출되지만
# 레이블 인덱스를 지정한 후에도 정수 인덱스는 유지됨(노출은 레이블 인덱스만) 
s[1], s['b'], s[-3]

(20, 20, 20)

In [ ]:
# 팬시 인덱싱
# 정수 혹은 레이블을 여러 개 전달
# 넘파이의 팬시 인덱싱과 동일
display(s[['a', 'b']])
display(s[[0, 0]])

a    10
b    20
dtype: int64

a    10
a    10
dtype: int64

In [ ]:
# 동일 인덱스를 갖는 값이 있을 경우
s.index = ['d', 'b', 'c', 'd']
s

d    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# 동일 인덱스의 값이 같이 출력
# 다만 동일 인덱스는 레이블에 한해서만 적용됨
# 정수 인덱스는 여전히 유니크
s['d']

d    10
d    40
dtype: int64

In [ ]:
s[3]

40

In [ ]:
s.index = ['a', 'b', 'c', 'd']
s

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# 시리즈의 슬라이싱
# 정수, 레이블 모두 가능
# 정수는 [시작, 끝)
# 레이블은 [시작, 끝]
display(s[1:3])
display(s['b':'c'])

b    20
c    30
dtype: int64

b    20
c    30
dtype: int64

In [ ]:
s.index = ['a', 'd', 'c', 'd']
s

a    10
d    20
c    30
d    40
dtype: int64

In [ ]:
# 동일 인덱스가 있는 경우
# 슬라이싱 불가
# 동일 인덱스 시작이나 끝이 아니라면 슬라이싱 가능
s['a':'c']

a    10
d    20
c    30
dtype: int64

In [ ]:
s[0:3]

a    10
d    20
c    30
dtype: int64

In [ ]:
# boolean 인덱싱
s[[True, False, True, False]]

a    10
c    30
dtype: int64

In [ ]:
# 시리즈에 대한 비교 연산의 결과는 시리즈
s>20

a    False
d    False
c     True
d     True
dtype: bool

In [ ]:
s[s>20]

c    30
d    40
dtype: int64

In [ ]:
# 시리즈의 값 수정
# 인덱싱 후 값 수정
s['a'] =100
s

a    100
d     20
c     30
d     40
dtype: int64

In [ ]:
s.index = list('abcd')

In [ ]:
# 팬시 인덱싱 후 값 수정
# 값 대입
s[['a', 'b']] = 200
s

a    200
b    200
c     30
d     40
dtype: int64

In [ ]:
# 팬시 인덱싱 후 값 수정
# 배열/리스트/시리즈 기타 동일 크기의 자료 구조 대입
# 불러온 순서대로 값 하나씩 전달
# 개수가 안 맞으면 오류
s[['a', 'b']] = [10, 20]
s

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# 슬라이싱 후 값 수정
s['a':'b'] = 100
s

a    100
b    100
c     30
d     40
dtype: int64

In [ ]:
s['a':'b'] = [10, 20]
s

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# 값 일괄 변경
s[:] = 100
s

a    100
b    100
c    100
d    100
dtype: int64

In [ ]:
s[:] = [100, 200, 300 ,400]
s

a    100
b    200
c    300
d    400
dtype: int64

In [ ]:
# loc 인덱서를 이용한 시리즈 조회
# 기본 인덱싱, 슬라이싱 방법과 동일
# 시리즈.loc[인덱스]
s.loc['a']

100

In [ ]:
# 팬시 인덱싱
s.loc[['a', 'b']]

a    100
b    200
dtype: int64

In [ ]:
# 슬라이싱
s.loc['a':'b']

a    100
b    200
dtype: int64

In [ ]:
s>200

a    False
b    False
c     True
d     True
dtype: bool

In [ ]:
# boolean 인덱싱
s.loc[s>200]

c    300
d    400
dtype: int64

In [ ]:
# iloc 인덱서를 이용한 시리즈 조회
# 정수 인덱스를 사용
s.iloc[0]

100

In [ ]:
s.iloc[[0, 1]]

a    100
b    200
dtype: int64

In [ ]:
s.iloc[:2]

a    100
b    200
dtype: int64

In [ ]:
s.iloc[[False, False, True, True]]

c    300
d    400
dtype: int64

In [ ]:
# 이러면 오류 납니다!
# s>200의 결과에 인덱스가 문자열로 되어있기 때문에!
s.iloc[s>200]

ValueError: ignored

In [ ]:
(s>200).values

array([False, False,  True,  True])

In [ ]:
# 값만 추출해서 사용
s.iloc[(s>200).values]

c    300
d    400
dtype: int64

In [ ]:
# at, iat 인덱서를 이용한 시리즈 조회
# 특정 값을 가져오는 인덱서
s.at['a'], s.iat[0]

(100, 100)

#### 시리즈에 새 인덱스 추가 및 삭제 (데이터)

In [ ]:
# 없는 인덱스 지정 후 값 대입
# 레이블로만 가능
s['E'] = 500

In [ ]:
s = s.append(pd.Series([100,200], index=['F', 'G']))
s

a    100
b    200
c    300
d    400
E    500
F    100
G    200
dtype: int64

In [ ]:
s.drop?

In [ ]:
# drop 함수 삭제
s = s.drop('E')
s

a    100
b    200
c    300
d    400
F    100
G    200
dtype: int64

In [ ]:
# 여러 개 인덱스는 묶어서 전달
s.drop(['a','b'])

c    300
d    400
E    500
dtype: int64

In [ ]:
# del 키워드로 특정 인덱스 삭제
del s['a']

In [ ]:
s

b    200
c    300
d    400
E    500
dtype: int64

#### 기타 함수

In [ ]:
# head, tail을 이용한 조회 (p165)
# head는 상위 n개
# tail은 하위 n개
s3 = pd.Series(np.arange(10), index=list('ABCDEFGHIJ'))
s3

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [ ]:
s3.head()

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [ ]:
s3.tail()

F    5
G    6
H    7
I    8
J    9
dtype: int64

In [ ]:
# where 함수
# 넘파이 where가 유사하지만 다름
# where(조건)인 경우 True인 값은 유지 False는 NaN
s3.where(s3>5)

A    NaN
B    NaN
C    NaN
D    NaN
E    NaN
F    NaN
G    6.0
H    7.0
I    8.0
J    9.0
dtype: float64

In [ ]:
# where(조건, 거짓 값)으로 사용 가능
s3.where(s3>5, -1)

A   -1
B   -1
C   -1
D   -1
E   -1
F   -1
G    6
H    7
I    8
J    9
dtype: int64

In [ ]:
# isin
# 열 내에 데이터가 있는지 확인하는 함수
# isin 함수에 전달된 목록에 있는 값이 열 내에 있을 경우 해당 값의 자리는 True, 아닌 값인 경우 False로 설정된 시리즈 반환
s_obj = pd.Series(['Kim', 'Lee', 'Park', 'Choi'])
s_int = pd.Series([24,27,34,19])

In [ ]:
s_obj.isin(['Kim', 'Choi'])

0     True
1    False
2    False
3     True
dtype: bool

In [ ]:
(s_obj == 'Kim')|(s_obj == 'Choi')

0     True
1    False
2    False
3     True
dtype: bool

In [ ]:
s_int.isin([34])

0    False
1    False
2     True
3    False
dtype: bool

#### 시리즈 정렬 (p166)

In [ ]:
# 시리즈 정렬
# sort_values(ascending=, inplace=) 값을 기준으로 정렬  
# sort_index(ascending=, inplace=) 인덱스를 기준으로 정렬
# ascending 기본은 True 오름차순
# inplace는 원본 수정 여부, 기본은 False(수정된 시리즈는 반환 값으로), True면 원본 수정(반환X)
s.sort_values(ascending=False)

c    400
d    300
a    200
b    100
dtype: int64

In [ ]:
s.sort_index(ascending=True)

a    200
b    100
c    400
d    300
dtype: int64

#### 시리즈에만 적용되는 함수

In [ ]:
# 시리즈에만 적용되는 함수
# unique
# 시리즈의 고윳값
s.unique()

array([100, 200, 300, 400])

In [ ]:
s[1:3] = 100
s.unique()

array([100, 400])

In [ ]:
# nunique
# 시리즈의 고윳값의 개수
s.nunique(), len(s.unique())

(2, 2)

In [ ]:
# value_counts (p188)
# 각 고윳값의 데이터 개수
s.value_counts()

100    3
400    1
dtype: int64

In [ ]:
# 문자열 함수 (p188)
# series.str.문자열함수로 사용가능
# 시리즈가 문자열 타입인 경우 적용
s2 = pd.Series(list('ABCDE'), index=list('abcde'))
s2

a    A
b    B
c    C
d    D
e    E
dtype: object

In [ ]:
s2.str.lower()

a    a
b    b
c    c
d    d
e    e
dtype: object

#### 시리즈 타입 변경 (p170)

In [ ]:
# 시리즈의 데이터 타입 변경 (p170)
# astype
s.astype('float64')

a    100.0
b    200.0
c    300.0
d    400.0
F    100.0
G    200.0
dtype: float64

In [ ]:
s['b'] = np.nan
s

a    100.0
b      NaN
c    300.0
d    400.0
F    100.0
G    200.0
dtype: float64

In [ ]:
# 변경 안 되는 타입인 경우 오류
s.astype('int64')

ValueError: ignored

In [ ]:
s['b'] = 200.0
s

a    100.0
b    200.0
c    300.0
d    400.0
F    100.0
G    200.0
dtype: float64

In [ ]:
s.astype(np.int64)

a    100
b    200
c    300
d    400
F    100
G    200
dtype: int64

In [ ]:
# 시리즈의 데이터 타입을 숫자형으로 변환
# to_numeric
s = s.astype('object')
s

b    200
a    100
d    100
c    400
dtype: object

In [ ]:
pd.to_numeric(s)

b    200.0
a    100.0
d    100.0
c    400.0
dtype: float64

In [ ]:
# 변환 불가능한 문자는 오류 처리
s['a'] = 'c'
# ignore => 값 유지
# coerce => NaN
pd.to_numeric(s, errors='coerce')

b    200.0
a      NaN
d    100.0
c    400.0
dtype: float64

In [ ]:
s[:] = ['20000', '10000', '10000', '40000']

In [ ]:
s

b    20000
a    10000
d    10000
c    40000
dtype: object

In [ ]:
pd.to_numeric(s, downcast='integer')

b    20000
a    10000
d    10000
c    40000
dtype: int32

In [ ]:
pd.to_numeric(s, downcast='unsigned')

b    20000
a    10000
d    10000
c    40000
dtype: uint16

In [ ]:
pd.to_numeric(s, downcast='float')

b    20000.0
a    10000.0
d    10000.0
c    40000.0
dtype: float32

In [ ]:
# 시리즈를 날짜 형 데이터(timestamp)로 변환
s[:] = ['20201123', '20201124', '20201125','20201126']
s

b    20201123
a    20201124
d    20201125
c    20201126
dtype: object

In [ ]:
# to_datetime (p177)
pd.to_datetime(s, format='%Y%m%d')

b   2020-11-23
a   2020-11-24
d   2020-11-25
c   2020-11-26
dtype: datetime64[ns]

#### 데이터프레임
 - 생성

In [ ]:
# DataFrame 함수 사용
# 1. 리스트/배열 전달
# 기본은 정수 인덱스가 노출됨
# 각 열은 한 시리즈, 따라서 열 별로 같은 자료형, 열 간에는 다른 자료형 가능
list1 = [[1,2,3],[4,5,6],[7,8,9]]

df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
# columns 매개 변수에 열의 레이블을 전달할 수 있음
# 레이블의 개수는 열의 개수와 동일해야 함
df = pd.DataFrame(list1, columns=['a', 'c', 'e'])
df

   a  c  e
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
# columns와 index를 동시에 전달할 수 있음
df = pd.DataFrame(list1, columns=['a', 'c', 'e'], index=[1,2,3])
df

   a  c  e
1  1  2  3
2  4  5  6
3  7  8  9

In [ ]:
# columns와 index를 동시에 전달할 수 있음
df = pd.DataFrame(list1, columns=['a', 'c', 'e'], index=[1,2,3])
df

   a  c  e
1  1  2  3
2  4  5  6
3  7  8  9

In [ ]:
# 2. 사전을 이용한 생성
# key는 각 열의 레이블
data = {
    'state': ['oh','oh','oh','Nev','Nev'],
    'year': [2000,2001,2002,2001,2002],
    'population':[1.5,1.7,2.3,2.9,3.2]
}
data

{'population': [1.5, 1.7, 2.3, 2.9, 3.2],
 'state': ['oh', 'oh', 'oh', 'Nev', 'Nev'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [ ]:
# columns를 따로 지정하지 않아도 key 값이 레이블로 설정됨
dataframe = pd.DataFrame(data)
dataframe

  state  year  population
0    oh  2000         1.5
1    oh  2001         1.7
2    oh  2002         2.3
3   Nev  2001         2.9
4   Nev  2002         3.2

In [ ]:
dataframe = pd.DataFrame(data, columns=['state','year', 'population', 'a'])
dataframe

  state  year  population    a
0    oh  2000         1.5  NaN
1    oh  2001         1.7  NaN
2    oh  2002         2.3  NaN
3   Nev  2001         2.9  NaN
4   Nev  2002         3.2  NaN

In [ ]:
# index와 columns를 지정할 수 있음
dataframe = pd.DataFrame(data, index=list('ABCDE'))
dataframe

  state  year  population
A    oh  2000         1.5
B    oh  2001         1.7
C    oh  2002         2.3
D   Nev  2001         2.9
E   Nev  2002         3.2

In [ ]:
# 열의 레이블 지정 시 key 값의 순서를 바꾸면 바뀐 순서로 데이터가 구성됨
df2 = pd.DataFrame(data, columns=['year', 'state', 'population'])
df2

   year state  population
0  2000    oh         1.5
1  2001    oh         1.7
2  2002    oh         2.3
3  2001   Nev         2.9
4  2002   Nev         3.2

In [ ]:
# 사전으로 데이터프레임 생성 시에는 열의 레이블 개수가 달라도 오류는 없음
# 많으면 NA로 채움
# 적으면 열이 사라짐
pd.DataFrame(data, columns=['year', 'state', 'population', 'test'])

   year state  population test
0  2000    oh         1.5  NaN
1  2001    oh         1.7  NaN
2  2002    oh         2.3  NaN
3  2001   Nev         2.9  NaN
4  2002   Nev         3.2  NaN

In [ ]:
# 사전에 입력한 key에 매칭되는 레이블이 없을 경우 데이터 배제
pd.DataFrame(data, columns=['year', 'state', 'population1'])

   year state population1
0  2000    oh         NaN
1  2001    oh         NaN
2  2002    oh         NaN
3  2001   Nev         NaN
4  2002   Nev         NaN

#### 데이터프레임의 주요 속성

In [ ]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df2.index =list('abcde')
df2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
df2.values

array([[2000, 'oh', 1.5],
       [2001, 'oh', 1.7],
       [2002, 'oh', 2.3],
       [2001, 'Nev', 2.9],
       [2002, 'Nev', 3.2]], dtype=object)

In [ ]:
df2.columns

Index(['year', 'state', 'population'], dtype='object')

In [ ]:
# 각 열 별 데이터 타입
df2.dtypes

year            int64
state          object
population    float64
dtype: object

In [ ]:
# Transpose
df2.T

               a     b     c     d     e
year        2000  2001  2002  2001  2002
state         oh    oh    oh   Nev   Nev
population   1.5   1.7   2.3   2.9   3.2

In [ ]:
df2.ndim, df2.shape

(2, (5, 3))

In [ ]:
df2.T.dtypes

a    object
b    object
c    object
d    object
e    object
dtype: object

#### 데이터 프레임 인덱스 변경

In [ ]:
# index, columns 속성
df2.columns = ['Year', 'State',	'Population']
df2.index = list('ABCDE')
df2

   Year State  Population
A  2000    oh         1.5
B  2001    oh         1.7
C  2002    oh         2.3
D  2001   Nev         2.9
E  2002   Nev         3.2

In [ ]:
# rename
# 행/열의 인덱스를 선택하여 변경
# axis에 따라 변경 대상이 다름
# axis=0 행의 인덱스
# axis=1 열의 인덱스
# inplace 옵션 설정
df2.rename({'A':'AA'}, axis=0)

    Year State  Population
AA  2000    oh         1.5
B   2001    oh         1.7
C   2002    oh         2.3
D   2001   Nev         2.9
E   2002   Nev         3.2

In [ ]:
df2.rename({'Year':'year'}, axis=1)

   year State  Population
A  2000    oh         1.5
B  2001    oh         1.7
C  2002    oh         2.3
D  2001   Nev         2.9
E  2002   Nev         3.2

In [ ]:
# set_index, reset_index
# 데이터 프레임의 특정 열을 인덱스로 지정
# 인덱스를 열로 추출
# 데이터 프레임을 수정하는 함수이므로 inplace 옵션 있음
df2.set_index('year')

     state  population
year
2000    oh         1.5
2001    oh         1.7
2002    oh         2.3
2001   Nev         2.9
2002   Nev         3.2

In [ ]:
# 인덱스 해제
df2.reset_index()

  index  year state  population
0     a  2000    oh         1.5
1     b  2001    oh         1.7
2     c  2002    oh         2.3
3     d  2001   Nev         2.9
4     e  2002   Nev         3.2

#### 데이터프레임의 인덱싱 및 슬라이싱

In [ ]:
# 데이터프레임 인덱싱: 열 선택
# 정수 혹은 문자열(label)을 이용한 인덱싱 가능
# 인덱스가 정수인 경우 정수
# 인덱스가 레이블인 경우 레이블
df = pd.DataFrame(np.arange(12).reshape(4,3), columns=list('ABC'), index=list('abcd'))
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
df['A']

a    0
b    3
c    6
d    9
Name: A, dtype: int64

In [ ]:
df.A

a    0
b    3
c    6
d    9
Name: A, dtype: int64

In [ ]:
# 데이터프레임 팬시 인덱싱: 열 선택
df[['A', 'B']]

   A
a  0
b  3
c  6
d  9

In [ ]:
# 열에 레이블이 부여된 경우
# 일반 인덱싱 방법으로는 정수 인덱스를 사용할 수 없음
df[0]

KeyError: ignored

In [ ]:
# 열의 레이블을 정수 인덱스로 변경
df.columns= [0,1,2]
df[0]

a    0
b    3
c    6
d    9
Name: 0, dtype: int64

In [ ]:
# 행의 인덱스인 경우 정수는 언제든 사용 가능
df.columns= list('ABC')
df.index = list('abcd')
df['A']['a']

0

In [ ]:
df['A'][0]

0

In [ ]:
# 데이터프레임의 슬라이싱: 행 선택
# 레이블, 정수 모두 사용 가능
# 레이블인 경우 [시작:끝]
# 정수인 경우 [시작:끝)
df['a':'c']

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [ ]:
df[0:3]

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [ ]:
# 데이터프레임의 boolean 인덱싱
# 1. T/F의 데이터프레임 이용
# False는 NaN, True는 유지
df[df>2]

     A     B     C
a  NaN   NaN   NaN
b  3.0   4.0   5.0
c  6.0   7.0   8.0
d  9.0  10.0  11.0

In [ ]:
# 2. T/F의 시리즈 이용
# True인 행 추출
# T/F의 시리즈의 개수는 행의 개수와 같아야 함
df[df['A']>5]

   A   B   C
c  6   7   8
d  9  10  11

In [ ]:
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
# loc, iloc, at, iat 인덱서를 이용한 인덱싱
# 데이터프레임에서의 loc/iloc 인덱서는 넘파이 배열과 유사하게 사용
# df.loc[행, 열]
# loc을 사용하는 경우 열에 레이블이 부여되어 있어도 정수 인덱스를 사용할 수 있음
df.loc['d', 'C'], df.iloc[3, 2], df.at['d', 'C'], df.iat[3, 2]

(11, 11, 11, 11)

In [ ]:
# loc, iloc 인덱서를 이용한 팬시 인덱싱
display(df.loc[['a', 'c'], ['A', 'B']])
display(df.iloc[[0, 2], [0, 1]])

   A  B
a  0  1
c  6  7

   A  B
a  0  1
c  6  7

In [ ]:
# loc, iloc 인덱서를 이용한 슬라이싱
display(df.loc['a':'c', 'A':'B'])
display(df.iloc[:3, :2])

   A  B
a  0  1
b  3  4
c  6  7

   A  B
a  0  1
b  3  4
c  6  7

In [ ]:
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
# loc, iloc 인덱서를 이용한 boolean 인덱싱
# 행 열 모두 적용 가능
# 행에 적용할 경우 행의 개수와 같은 TF시리즈,배열,리스트 전달 -> 행 추출 (모든 열 포함)
# 열에 적용할 경우 열의 개수와 같은 TF시리즈,배열,리스트 전달 -> 열 추출 (모든 행 포함)
df.loc[[True, True, False, False], :]

   A  B  C
a  0  1  2
b  3  4  5

In [ ]:
df.loc[:, [True, True, False]]

   A   B
a  0   1
b  3   4
c  6   7
d  9  10

In [ ]:
df.loc[df['A']>3, :]

   A   B   C
c  6   7   8
d  9  10  11

In [ ]:
df.loc[:, df.columns.str.startswith('A')]

   A
a  0
b  3
c  6
d  9

In [ ]:
# 행과 열을 동시에 boolean 인덱싱
df.loc[df['A']>3, df.columns.str.startswith('A')]

   A
c  6
d  9

In [ ]:
# head, tail
# head(n) 상위 n개 행 출력
# tail(n) 하위 n개 행 출력
# n=5 기본
display(df.head())
display(df.tail(3))

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

   A   B   C
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
pd.DataFrame([[1,2,3,4]]).shape

(1, 4)

#### 데이터프레임의 값 정렬

In [ ]:
# sort_index, sort_values
# 시리즈에서 사용한 함수와 같음
# 2차원이기 때문에 축 정보를 axis에 전달
# axis=0이면 행의 인덱스/값  -> 기본
# axis=1이면 열의 인덱스/값
df.sort_index(ascending=False)

   A   B   C
d  9  10  11
c  6   7   8
b  3   4   5
a  0   1   2

In [ ]:
df.sort_index(axis=1, ascending=False)

    C   B  A
a   2   1  0
b   5   4  3
c   8   7  6
d  11  10  9

In [ ]:
df
df['E']['a'] =np.nan
display(df.sort_values(by=['D', 'E']))
display(df.sort_values(by=['D', 'E'],ascending=False))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   A   B   C   D     E
d  9  10  11   3  33.0
b  3   4   5   3  50.0
a  0   1   2   9   NaN
c  6   7   8  10   1.0

   A   B   C   D     E
c  6   7   8  10   1.0
a  0   1   2   9   NaN
b  3   4   5   3  50.0
d  9  10  11   3  33.0

In [ ]:
df['D'] = [9, 3, 10, 3]
df['E'] = [10, 50, 1, 33]
df

   A   B   C   D   E
a  0   1   2   9  10
b  3   4   5   3  50
c  6   7   8  10   1
d  9  10  11   3  33

In [ ]:
# sort_values
# 특정 열의 값을 기준으로 정렬
# by= 매개변수에 열 전달 (값/리스트,배열 가능)
# ascending= 매개변수도 여러 개 전달 가능 (하나인 경우 일괄 적용)
df.sort_values(by='D' , ascending=False)

   A   B   C   D   E
c  6   7   8  10   1
a  0   1   2   9  10
b  3   4   5   3  50
d  9  10  11   3  33

In [ ]:
# D 열의 값처럼 중복 값이 있을 경우 두 번째 열을 지정하여 추가 정렬 수행 가능
# D E 열 모두 내림차순으로 정렬
df.sort_values(by=['D','E'] , ascending=False)

   A   B   C   D   E
c  6   7   8  10   1
a  0   1   2   9  10
b  3   4   5   3  50
d  9  10  11   3  33

In [ ]:
# D E 열을 각각 다른 기준으로 정렬하고 싶으면 ascending 값을 리스트로 전달
df.sort_values(by=['D','E'] , ascending=[False, True])

   A   B   C   D   E
c  6   7   8  10   1
a  0   1   2   9  10
d  9  10  11   3  33
b  3   4   5   3  50

#### 데이터프레임의 값 수정

In [ ]:
df = pd.DataFrame(np.arange(12).reshape(4,3), columns=list('ABC'), index=list('abcd'))
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
# 인덱싱 후 값 수정
# 2차원 자료구조이기 때문에 열 선택 -> 행 선택 -> 대입의 형태로 접근
df['A']['a'] = 100
df

     A   B   C
a  100   1   2
b    3   4   5
c    6   7   8
d    9  10  11

In [ ]:
# 인덱싱 후 값 수정
# 열 전체 수정
df['A'] = 100
df

     A   B   C
a  100   1   2
b  100   4   5
c  100   7   8
d  100  10  11

In [ ]:
df['A'] = [0, 3, 6, 9]
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
# 팬시 인덱싱 후 값 수정
# 값 대입
# 배열/리스트/시리즈 기타 동일 크기의 자료 구조 대입
df[['A', 'B']] = 100
df

     A    B   C
a  100  100   2
b  100  100   5
c  100  100   8
d  100  100  11

In [ ]:
df[['A', 'B']] = [[0,1],[3,4],[6,7],[9,10]]
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
df['D'] = list('ABCD')
df

   A   B   C  D
a  0   1   2  A
b  3   4   5  B
c  6   7   8  C
d  9  10  11  D

In [ ]:
# 슬라이싱 후 값 대입
df['a':'b'] = 10
df

    A   B   C   D
a  10  10  10  10
b  10  10  10  10
c   6   7   8   C
d   9  10  11   D

In [ ]:
df.dtypes, type(df['D']['a'])

(A     int64
 B     int64
 C     int64
 D    object
 dtype: object, int)

In [ ]:
df['a':'b'] =[[0,1,2,'A'], [3,4,5,'B']]
df

   A   B   C  D
a  0   1   2  A
b  3   4   5  B
c  6   7   8  C
d  9  10  11  D

In [ ]:
# boolean 인덱싱 후 값 대입
df[df['A']>5] = 1
df

   A  B  C  D
a  0  1  2  A
b  3  4  5  B
c  1  1  1  1
d  1  1  1  1

In [ ]:
df = df.drop('E', axis=1)
df

   A   B   C   D
a  0   1   2   9
b  3   4   5   3
c  6   7   8  10
d  9  10  11   3

In [ ]:
df[df>5] = -1

In [ ]:
df

   A  B  C  D
a  0  1  2 -1
b  3  4  5  3
c -1 -1 -1 -1
d -1 -1 -1  3

In [ ]:
df['c':'d'] = [[7,8,9,'C'], [10,11,12,'D']]
df

    A   B   C   D
a   0   1   2  -1
b   3   4   5   3
c   7   8   9   C
d  10  11  12   D

In [ ]:
# loc 인덱서를 이용한 값 수정
# 인덱싱
df.loc['a', 'A'] = 10
df.at['b', 'B'] = 50
df.iloc[2, 2] = 90
df.iat[3, 3] = '10D'
df

    A   B   C    D
a  10   1   2    A
b   3  50   5    B
c   7   8  90    C
d  10  11  12  10D

In [ ]:
# loc 인덱서를 이용한 값 수정
# 슬라이싱
df.loc['a':'b', 'A':'B'] = 100
df.iloc[2:, 2:] = 200
df

     A    B    C    D
a  100  100    2    A
b  100  100    5    B
c    7    8  200  200
d   10   11  200  200

In [ ]:
# 전체 데이터프레임에 대해 비교하여 수정
df = pd.DataFrame(np.arange(12).reshape(4,3), columns=list('ABC'), index=list('abcd'))
df[df>3]

     A     B     C
a  NaN   NaN   NaN
b  NaN   4.0   5.0
c  6.0   7.0   8.0
d  9.0  10.0  11.0

In [ ]:
# 참인 값은 변경
# 거짓인 값은 유지
df[df>3] = 10
df

    A   B   C
a   0   1   2
b   3  10  10
c  10  10  10
d  10  10  10

#### 데이터프레임 추가

In [ ]:
# 열 추가
# 없는 열 레이블 지정 후 값 대입
df['E'] = 10
df

    A   B   C   D   E
a   0   1   2  -1  10
b   3   4   5   3  10
c   7   8   9   C  10
d  10  11  12   D  10

In [ ]:
# 열 추가
# assign 함수
# 열=값
df.assign(F=10, G=20)

     A    B    C    D   E   F   G
a  100  100    2    A  10  10  20
b  100  100    5    B  10  10  20
c    7    8  200  200  10  10  20
d   10   11  200  200  10  10  20

In [ ]:
# 행 추가
# 사전 형태로 전달
# 인덱스에 문제가 있는 경우 무시하면 인덱스가 정수로 바뀜
df.append({'A': 2, 'B': 3,'C': 4, 'D': 5}, ignore_index=True)

       A      B      C    D     E
0  100.0  100.0    2.0    A  10.0
1  100.0  100.0    5.0    B  10.0
2    7.0    8.0  200.0  200  10.0
3   10.0   11.0  200.0  200  10.0
4    2.0    3.0    4.0    5   NaN

In [ ]:
temp = pd.DataFrame([[1,2,3,4,5]], columns = df.columns, index=['e'])
temp

   A  B  C  D  E
e  1  2  3  4  5

In [ ]:
# 데이터프레임을 생성해서 전달
# 열 레이블을 맞추고 새 인덱스를 지정하면 오류 없이 추가됨
temp = pd.DataFrame([(1,2,3,4,5)], columns = df.columns, index=['e'])

df.append(temp)

     A    B    C    D   E
a  100  100    2    A  10
b  100  100    5    B  10
c    7    8  200  200  10
d   10   11  200  200  10
e    1    2    3    4   5

In [ ]:
# loc 인덱서를 이용하여 전달
df.loc['f', :] = [100, 200, 300, 400, 500]
df

       A      B      C    D      E
a  100.0  100.0    2.0    A   10.0
b  100.0  100.0    5.0    B   10.0
c    7.0    8.0  200.0  200   10.0
d   10.0   11.0  200.0  200   10.0
f  100.0  200.0  300.0  400  500.0

In [ ]:
df2 = pd.DataFrame(np.random.random((8, 4)), columns=list('ABCD'))
df2

          A         B         C         D
0  0.436311  0.012639  0.303991  0.806844
1  0.844156  0.732566  0.699235  0.968612
2  0.550307  0.981204  0.139534  0.629915
3  0.067928  0.043867  0.632960  0.476736
4  0.519489  0.747066  0.915436  0.077995
5  0.235283  0.860884  0.646364  0.077048
6  0.355036  0.238279  0.962014  0.172398
7  0.153320  0.415721  0.471374  0.492171

In [ ]:
# where 함수
# 조건만 있으면 참일 때 유지, 거짓일 대 NA
# condition, 거짓 값
df2.where(df2<0.5)

          A         B         C         D
0  0.472436       NaN  0.254134  0.155470
1       NaN  0.410837  0.280509  0.171846
2       NaN  0.433921       NaN       NaN
3       NaN       NaN  0.487845  0.427576
4       NaN  0.067169       NaN       NaN
5       NaN  0.187442       NaN  0.359690
6       NaN  0.476028  0.129004       NaN
7  0.100308  0.317278       NaN       NaN

In [ ]:
df2.where(df2<0.5, 0)

          A         B         C         D
0  0.472436  0.000000  0.254134  0.155470
1  0.000000  0.410837  0.280509  0.171846
2  0.000000  0.433921  0.000000  0.000000
3  0.000000  0.000000  0.487845  0.427576
4  0.000000  0.067169  0.000000  0.000000
5  0.000000  0.187442  0.000000  0.359690
6  0.000000  0.476028  0.129004  0.000000
7  0.100308  0.317278  0.000000  0.000000

In [ ]:
df2

          A         B         C         D
0  0.472436  0.857262  0.254134  0.155470
1  0.961793  0.410837  0.280509  0.171846
2  0.747306  0.433921  0.791568  0.853689
3  0.968589  0.944626  0.487845  0.427576
4  0.876274  0.067169  0.570752  0.500004
5  0.602592  0.187442  0.770894  0.359690
6  0.794694  0.476028  0.129004  0.713094
7  0.100308  0.317278  0.896484  0.646574

In [ ]:
np.round(df2, 2)

      A     B     C     D
0  0.47  0.86  0.25  0.16
1  0.96  0.41  0.28  0.17
2  0.75  0.43  0.79  0.85
3  0.97  0.94  0.49  0.43
4  0.88  0.07  0.57  0.50
5  0.60  0.19  0.77  0.36
6  0.79  0.48  0.13  0.71
7  0.10  0.32  0.90  0.65

In [ ]:
df2 = np.round(df2, 2)
df2

      A     B     C     D
0  0.44  0.01  0.30  0.81
1  0.84  0.73  0.70  0.97
2  0.55  0.98  0.14  0.63
3  0.07  0.04  0.63  0.48
4  0.52  0.75  0.92  0.08
5  0.24  0.86  0.65  0.08
6  0.36  0.24  0.96  0.17
7  0.15  0.42  0.47  0.49

In [ ]:
# isin
# df 내에 값이 있는지 확인
# isin 함수에 전달된 목록에 있는 값이 df에 있을 경우 해당 값의 자리는 True, 아닌 값인 경우 False로 설정된 시리즈 반환
df2.isin([0.47, 0.07])

       A      B      C      D
0   True  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False   True  False  False
5  False  False  False  False
6  False  False  False  False
7  False  False  False  False

In [ ]:
df2.isin([0.15])

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False  False
7   True  False  False  False

#### 데이터프레임 타입 변경 (p170)

In [ ]:
df2.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [ ]:
# 데이터프레임의 데이터 타입 변경 (p170)
# astype
df2.astype('int64')

   A  B  C  D
0  0  0  0  0
1  0  0  0  0
2  0  0  0  0
3  0  0  0  0
4  0  0  0  0
5  0  0  0  0
6  0  0  0  0
7  0  0  0  0

In [ ]:
# 일부만 변경
# 사전으로 전달
# 열 레이블:타입
df2.astype({'A': 'int64', 'B': 'object'})

   A     B     C     D
0  0  0.86  0.25  0.16
1  0  0.41  0.28  0.17
2  0  0.43  0.79  0.85
3  0  0.94  0.49  0.43
4  0  0.07  0.57  0.50
5  0  0.19  0.77  0.36
6  0  0.48  0.13  0.71
7  0  0.32  0.90  0.65

In [ ]:
# 특정 열만 변경
# 시리즈의 변경과 동일
df2['A'].astype('int64')

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
Name: A, dtype: int64

In [ ]:
# 날짜형으로 변경
# 열 이름이 year month day minute second ms us ns인 경우 적용
data = {
    'year':[2020, 1988, 1972],
    'month':[1, 12, 8],
    'day': [11,23,19]
}

df3 = pd.DataFrame(data)
df3

   year  month  day
0  2020      1   11
1  1988     12   23
2  1972      8   19

In [ ]:
pd.to_datetime(df3)

0   2020-01-11
1   1988-12-23
2   1972-08-19
dtype: datetime64[ns]

In [ ]:
# 개별 열 변환
df4 = pd.DataFrame(['20201123', '20201124', '20201125','20201126'], columns=['A'])
df4

          A
0  20201123
1  20201124
2  20201125
3  20201126

In [ ]:
pd.to_datetime(df4['A'])

0   2020-11-23
1   2020-11-24
2   2020-11-25
3   2020-11-26
Name: A, dtype: datetime64[ns]

In [ ]:
pd.to_datetime(df4['A'], format='%Y%m%d')

0   2020-11-23
1   2020-11-24
2   2020-11-25
3   2020-11-26
Name: A, dtype: datetime64[ns]

In [ ]:
# 시리즈를 날짜 형 데이터(timestamp)로 변환
s[:] = ['20201123', '20201124', '20201125','20201126']
s

b    20201123
a    20201124
d    20201125
c    20201126
dtype: object

In [ ]:
# to_datetime (p177)
pd.to_datetime(s, format='%Y%m%d')

b   2020-11-23
a   2020-11-24
d   2020-11-25
c   2020-11-26
dtype: datetime64[ns]

#### Datetime 인덱스 생성

In [ ]:
# date_range 함수 
# periods 개수의 datetime64 데이터 생성
# freq로 간격 지정
'''
freq 옵션 값
B        business day frequency
C        custom business day frequency
D        calendar day frequency
W        weekly frequency
M        month end frequency
SM       semi-month end frequency (15th and end of month)
BM       business month end frequency
CBM      custom business month end frequency
MS       month start frequency
SMS      semi-month start frequency (1st and 15th)
BMS      business month start frequency
CBMS     custom business month start frequency
Q        quarter end frequency
BQ       business quarter end frequency
QS       quarter start frequency
BQS      business quarter start frequency
A, Y     year end frequency
BA, BY   business year end frequency
AS, YS   year start frequency
BAS, BYS business year start frequency
BH       business hour frequency
H        hourly frequency
T, min   minutely frequency
S        secondly frequency
L, ms    milliseconds
U, us    microseconds
N        nanoseconds
'''

dates = pd.date_range('20200101', periods=6, freq='D')
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates = pd.date_range('2020-01-01', periods=6, freq='D')
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
# 인덱스로 지정
df3 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df3

                   A         B         C         D
2020-01-01  0.881895  1.202651  1.600815  1.312275
2020-01-02 -1.168776  0.593036  1.671930 -0.018440
2020-01-03  0.836591 -0.976918  0.500537 -0.953618
2020-01-04  0.674080  1.018183 -0.075068 -0.583163
2020-01-05  0.071359 -0.646058 -0.286335  1.498428
2020-01-06 -1.269335  2.897530  0.586670  0.099711

In [ ]:
# 데이터로 지정
df3['dates'] = dates
df3

                   A         B         C         D      dates
2020-01-01  0.881895  1.202651  1.600815  1.312275 2020-01-01
2020-01-02 -1.168776  0.593036  1.671930 -0.018440 2020-01-02
2020-01-03  0.836591 -0.976918  0.500537 -0.953618 2020-01-03
2020-01-04  0.674080  1.018183 -0.075068 -0.583163 2020-01-04
2020-01-05  0.071359 -0.646058 -0.286335  1.498428 2020-01-05
2020-01-06 -1.269335  2.897530  0.586670  0.099711 2020-01-06

In [ ]:
# datetime64의 특징
# 타임스탬프
type(dates[0])

pandas._libs.tslibs.timestamps.Timestamp

In [ ]:
dir(df3.index[0])

['__add__',
 '__array_priority__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__pyx_vtable__',
 '__radd__',
 '__reduce__',
 '__reduce_cython__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__setstate__',
 '__setstate_cython__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__weakref__',
 '_date_repr',
 '_repr_base',
 '_round',
 '_short_repr',
 '_time_repr',
 'asm8',
 'astimezone',
 'ceil',
 'combine',
 'ctime',
 'date',
 'day',
 'day_name',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'dst',
 'floor',
 'fold',
 'freq',
 'freqstr',
 'fromordinal',
 'fromtimestamp',
 'hour',
 'is_leap_year',
 'is_month_end',
 'is_month_start',
 'is_quarter_end',
 'is_quarter_start',
 'is_year_end',
 'is_year_start',
 'isocalendar',
 'isoformat',
 'isoweekday',
 'max',
 'microsecond',
 'min',
 'minute',
 'month',
 'month_name',
 'nanosecond',
 'normalize',
 'now',
 'quarter',
 'replace',
 'resolution',
 'round',
 'second',
 'strftime',
 'strptime',
 'time',
 'timestamp',
 'timetuple',
 'timetz',
 'to_datetime64',
 'to_julian_date',
 'to_numpy',
 'to_period',
 'to_pydatetime',
 'today',
 'toordinal',
 'tz',
 'tz_convert',
 'tz_localize',
 'tzinfo',
 'tzname',
 'utcfromtimestamp',
 'utcnow',
 'utcoffset',
 'utctimetuple',
 'value',
 'week',
 'weekday',
 'weekofyear',
 'year']

In [ ]:
df3.index[0].year, df3.index[0].month, df3.index[1].day

(2020, 1, 2)

In [ ]:
df3

                   A         B         C         D      dates
2020-01-01  0.026645 -1.221953  0.692544  1.125702 2020-01-01
2020-01-02 -0.499155 -1.360647  0.443626 -0.583819 2020-01-02
2020-01-03 -0.222698  0.277527 -2.453895 -0.004814 2020-01-03
2020-01-04 -0.152790 -1.371351 -0.479458 -1.588082 2020-01-04
2020-01-05  0.760129  1.966220 -1.007345 -1.337938 2020-01-05
2020-01-06 -1.463004  0.956696  0.621199  1.251219 2020-01-06

In [ ]:
# 2020년 1월의 짝수 일만 추출
df3[(df3.index.year==2020)&(df3.index.month==1)&(df3.index.day%2==0)]

                   A         B         C         D      dates
2020-01-02 -0.499155 -1.360647  0.443626 -0.583819 2020-01-02
2020-01-04 -0.152790 -1.371351 -0.479458 -1.588082 2020-01-04
2020-01-06 -1.463004  0.956696  0.621199  1.251219 2020-01-06

### 데이터프레임 행/열 삭제

In [ ]:
df4 = df3.copy()

In [ ]:
df4

                   A         B         C         D      dates
2020-01-01  0.026645 -1.221953  0.692544  1.125702 2020-01-01
2020-01-02 -0.499155 -1.360647  0.443626 -0.583819 2020-01-02
2020-01-03 -0.222698  0.277527 -2.453895 -0.004814 2020-01-03
2020-01-04 -0.152790 -1.371351 -0.479458 -1.588082 2020-01-04
2020-01-05  0.760129  1.966220 -1.007345 -1.337938 2020-01-05
2020-01-06 -1.463004  0.956696  0.621199  1.251219 2020-01-06

In [ ]:
# drop 함수
# 시리즈에서의 사용법 + axis 제어
# axis=0이면 행의 인덱스 전달
# axis=1이면 열의 인덱스 전달
df4.drop(df4.index[0], axis=0)

                   A         B         C         D      dates
2020-01-02 -0.499155 -1.360647  0.443626 -0.583819 2020-01-02
2020-01-03 -0.222698  0.277527 -2.453895 -0.004814 2020-01-03
2020-01-04 -0.152790 -1.371351 -0.479458 -1.588082 2020-01-04
2020-01-05  0.760129  1.966220 -1.007345 -1.337938 2020-01-05
2020-01-06 -1.463004  0.956696  0.621199  1.251219 2020-01-06

In [ ]:
# 여러 줄 삭제
df4.drop(df4.index[0:3], axis=0)

                   A         B         C         D      dates
2020-01-04 -0.152790 -1.371351 -0.479458 -1.588082 2020-01-04
2020-01-05  0.760129  1.966220 -1.007345 -1.337938 2020-01-05
2020-01-06 -1.463004  0.956696  0.621199  1.251219 2020-01-06

In [ ]:
df4.drop(df4.index[[0, 1, 3]], axis=0)

                   A         B         C         D      dates
2020-01-03 -0.222698  0.277527 -2.453895 -0.004814 2020-01-03
2020-01-05  0.760129  1.966220 -1.007345 -1.337938 2020-01-05
2020-01-06 -1.463004  0.956696  0.621199  1.251219 2020-01-06

In [ ]:
# 열 삭제
df4.drop(df4.columns[0], axis=1)

                   B         C         D      dates
2020-01-01 -1.221953  0.692544  1.125702 2020-01-01
2020-01-02 -1.360647  0.443626 -0.583819 2020-01-02
2020-01-03  0.277527 -2.453895 -0.004814 2020-01-03
2020-01-04 -1.371351 -0.479458 -1.588082 2020-01-04
2020-01-05  1.966220 -1.007345 -1.337938 2020-01-05
2020-01-06  0.956696  0.621199  1.251219 2020-01-06